; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	satellite1 - satellite
	instrument1 - instrument
	satellite2 - satellite
	instrument2 - instrument
	satellite3 - satellite
	instrument3 - instrument
	satellite4 - satellite
	instrument4 - instrument
	image2 - mode
	thermograph0 - mode
	infrared3 - mode
	image1 - mode
	GroundStation1 - direction
	GroundStation3 - direction
	GroundStation4 - direction
	Star9 - direction
	Star7 - direction
	GroundStation0 - direction
	Star6 - direction
	GroundStation2 - direction
	GroundStation8 - direction
	GroundStation10 - direction
	Star11 - direction
	Star5 - direction
	Planet12 - direction
	Star13 - direction
	Phenomenon14 - direction
)
(:init
	(supports instrument0 image1)
	(calibration_target instrument0 Star7)
	(on_board instrument0 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star13)
	(supports instrument1 image2)
	(calibration_target instrument1 GroundStation0)
	(on_board instrument1 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation0)
	(supports instrument2 thermograph0)
	(supports instrument2 image1)
	(supports instrument2 infrared3)
	(calibration_target instrument2 GroundStation8)
	(calibration_target instrument2 GroundStation2)
	(calibration_target instrument2 Star6)
	(on_board instrument2 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Phenomenon14)
	(supports instrument3 image2)
	(calibration_target instrument3 Star11)
	(calibration_target instrument3 GroundStation10)
	(on_board instrument3 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation8)
	(supports instrument4 image2)
	(supports instrument4 image1)
	(calibration_target instrument4 Star5)
	(on_board instrument4 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation3)
)
(:goal (and
	(pointing satellite0 GroundStation0)
	(pointing satellite3 Star9)
	(have_image Planet12 image1)
	(have_image Star13 infrared3)
	(have_image Phenomenon14 infrared3)
))

)

; plan
1. (turn_to satellite3 star9 groundstation8)
   deleted: (pointing satellite3 groundstation8)
   added: (pointing satellite3 star9)
   goals met: 1 of 5
2. (turn_to satellite2 groundstation2 phenomenon14)
   deleted: (pointing satellite2 phenomenon14)
   added: (pointing satellite2 groundstation2)
   goals met: 1 of 5
3. (switch_on instrument2 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument2)
   goals met: 1 of 5
4. (calibrate satellite2 instrument2 groundstation2)
   added: (calibrated instrument2)
   goals met: 1 of 5
5. (turn_to satellite2 phenomenon14 groundstation2)
   deleted: (pointing satellite2 groundstation2)
   added: (pointing satellite2 phenomenon14)
   goals met: 1 of 5
6. (turn_to satellite0 groundstation0 star13)
   deleted: (pointing satellite0 star13)
   added: (pointing satellite0 groundstation0)
   goals met: 2 of 5
7. (take_image satellite2 phenomenon14 instrument2 infrared3)
   added: (have_image phenomenon14 infrared3)
   goals met: 3 of 5
8. (turn_to satellite2 planet12 phenomenon14)
   deleted: (pointing satellite2 phenomenon14)
   added: (pointing satellite2 planet12)
   goals met: 3 of 5
9. (take_image satellite2 planet12 instrument2 image1)
   added: (have_image planet12 image1)
   goals met: 4 of 5
10. (turn_to satellite2 star13 planet12)
   deleted: (pointing satellite2 planet12)
   added: (pointing satellite2 star13)
   goals met: 4 of 5
11. (take_image satellite2 star13 instrument2 infrared3)
   added: (have_image star13 infrared3)
   goals met: 5 of 5
